<!DOCTYPE html><html lang="ru" data-theme="auto" prefix="og: http://ogp.me/ns#"><head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0, viewport-fit=cover">
    <link rel="alternate" type="application/rss+xml" title href="https://t.me/htmlshit/feed.xml">
    









<title>&#x421;&#x43E;&#x43B;&#x438;&#x434;&#x431;&#x443;&#x43A; - @htmlshit</title>
<link rel="canonical" href="https://t.me/htmlshit/blog/solidbook/">

<meta property="og:site_name" content="@htmlshit">
<meta property="og:title" content="&#x421;&#x43E;&#x43B;&#x438;&#x434;&#x431;&#x443;&#x43A; - @htmlshit">
<meta property="og:type" content="website">
<meta property="og:url" content="https://t.me/htmlshit/blog/solidbook/">
<meta property="twitter:url" content="https://t.me/htmlshit/blog/solidbook/">
<meta property="twitter:site" content="@htmlshit">


  <meta name="twitter:creator" content="@bekharsky">


<meta name="description" content="&#x411;&#x443;&#x434;&#x43D;&#x438; &#x432;&#x435;&#x440;&#x441;&#x442;&#x430;&#x43B;&#x44C;&#x449;&#x438;&#x43A;&#x430;: &#x43A;&#x430;&#x43D;&#x430;&#x43B; &#x43E; &#x432;&#x451;&#x440;&#x441;&#x442;&#x43A;&#x435;, &#x444;&#x440;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x434;&#x435; &#x438; &#x432;&#x435;&#x431;-&#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x435; &#x432;&#x43E;&#x43E;&#x431;&#x449;&#x435;">
<meta name="twitter:description" content="&#x411;&#x443;&#x434;&#x43D;&#x438; &#x432;&#x435;&#x440;&#x441;&#x442;&#x430;&#x43B;&#x44C;&#x449;&#x438;&#x43A;&#x430;: &#x43A;&#x430;&#x43D;&#x430;&#x43B; &#x43E; &#x432;&#x451;&#x440;&#x441;&#x442;&#x43A;&#x435;, &#x444;&#x440;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x434;&#x435; &#x438; &#x432;&#x435;&#x431;-&#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x435; &#x432;&#x43E;&#x43E;&#x431;&#x449;&#x435;">
<meta property="og:description" content="&#x411;&#x443;&#x434;&#x43D;&#x438; &#x432;&#x435;&#x440;&#x441;&#x442;&#x430;&#x43B;&#x44C;&#x449;&#x438;&#x43A;&#x430;: &#x43A;&#x430;&#x43D;&#x430;&#x43B; &#x43E; &#x432;&#x451;&#x440;&#x441;&#x442;&#x43A;&#x435;, &#x444;&#x440;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x434;&#x435; &#x438; &#x432;&#x435;&#x431;-&#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x435; &#x432;&#x43E;&#x43E;&#x431;&#x449;&#x435;">


  <meta property="og:image" content="https://t.me/htmlshit/cover.jpg">
  <meta name="twitter:image" content="https://t.me/htmlshit/cover.jpg">


    <link rel="icon" type="image/png" href="/favicon-32x32.png" sizes="32x32">
    <link rel="icon" type="image/png" href="/favicon-16x16.png" sizes="16x16">
    <link rel="preconnect" href="https://cdn.jsdelivr.net">
    <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/modern-normalize@1/modern-normalize.min.css">
    <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/@native-elements/core@1/native-elements.css">
    
  
    <link rel="preload" as="style" href="/static/css/prism-okaidia.css">
    <link rel="stylesheet" href="/static/css/prism-okaidia.css">
  

    <link rel="stylesheet" href="/static/css/theme.css">
    <link rel="stylesheet" href="/static/css/app.css">
    <script src="https://cdn.jsdelivr.net/npm/what-input@5.2.6/dist/what-input.min.js" defer></script>
    <script type="module" src="/static/js/app.js" defer></script>
  <link rel="modulepreload" href="/static/js/app.js"></head>
  <body>
    
  <main tabindex="-1">
    <header>
  
    <nav>
      
        
          
          

          
          
          <a href="/">
            <b>&#x41E; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x435;</b>
          </a>
        
      
        
          
          

          
          
          <a href="/blog/">
            <b>&#x411;&#x43B;&#x43E;&#x433;</b>
          </a>
        
      
        
      
        
      
    </nav>
  
  <select name="themeSwitcher" id="themeSwitcher" value="auto">
  <option value="auto">&#x430;&#x432;&#x442;&#x43E;</option>
  <option value="light">&#x434;&#x435;&#x43D;&#x44C;</option>
  <option value="dark">&#x43D;&#x43E;&#x447;&#x44C;</option>
</select>

</header>


    
      <small><time datetime="2021-01-17T00:00:00.000Z">17 &#x42F;&#x43D;&#x432;&#x430;&#x440;&#x44F; 2021</time></small>
    

    <h1>&#x421;&#x43E;&#x43B;&#x438;&#x434;&#x431;&#x443;&#x43A;</h1>

    
      <ul style="all: unset; display: flex; list-style: none; flex-wrap: wrap">
      
        <li style="margin-right: 16px"><a href="/blog/tag/oop/">#oop</a></li>
      
        <li style="margin-right: 16px"><a href="/blog/tag/solid/">#solid</a></li>
      
        <li style="margin-right: 16px"><a href="/blog/tag/link/">#link</a></li>
      
      </ul>
    

    <hr>

    <article ne-prose>
      <p>&#x41F;&#x43E;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x443; &#x43D;&#x430; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442; &#x437;&#x43D;&#x430;&#x447;&#x438;&#x43C;&#x443;&#x44E; &#x430;&#x443;&#x434;&#x438;&#x442;&#x43E;&#x440;&#x438;&#x44E; &#x43A;&#x430;&#x43D;&#x430;&#x43B;&#x430; &#x441;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x44E;&#x442; &#x441;&#x442;&#x443;&#x434;&#x435;&#x43D;&#x442;&#x44B; &#x43A;&#x443;&#x440;&#x441;&#x43E;&#x432;, &#x431;&#x44B;&#x43B;&#x43E; &#x431;&#x44B; &#x43D;&#x435;&#x43B;&#x438;&#x448;&#x43D;&#x438;&#x43C; &#x443;&#x43F;&#x43E;&#x43C;&#x44F;&#x43D;&#x443;&#x442;&#x44C; &#x43E; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x438;&#x445; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x430;&#x445;. &#x41D;&#x43E; &#x442;&#x435;&#x43C;&#x430; &#x44D;&#x442;&#x430; &#x441;&#x43B;&#x438;&#x448;&#x43A;&#x43E;&#x43C; &#x43E;&#x433;&#x440;&#x43E;&#x43C;&#x43D;&#x430;&#x44F;, &#x43F;&#x43E;&#x442;&#x43E;&#x43C;&#x443; &#x43D;&#x430;&#x447;&#x43D;&#x451;&#x43C; &#x441; &#x43F;&#x440;&#x44F;&#x43C;&#x44B;&#x445; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x43E;&#x432;.</p>
<p>&#x412; &#x447;&#x430;&#x442;&#x435; &#x43A;&#x430;&#x43D;&#x430;&#x43B;&#x430; (@htmlshitchat) &#x43F;&#x440;&#x43E;&#x441;&#x43A;&#x43E;&#x447;&#x438;&#x43B;&#x43E; &#x436;&#x435;&#x43B;&#x430;&#x43D;&#x438;&#x435; &#x43F;&#x43E;&#x447;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x43E;&#x431; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x43D;&#x43E;-&#x43E;&#x440;&#x438;&#x435;&#x43D;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x43E;&#x43C; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x438; (&#x41E;&#x41E;&#x41F;). &#x412;&#x44B;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x43E; &#x43E;&#x43D;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x434;&#x43E;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x43E; &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43A;&#x442;&#x43D;&#x43E;, &#x43D;&#x43E; &#x432;&#x441;&#x451; &#x436;&#x435; &#x43F;&#x43E;&#x43F;&#x440;&#x43E;&#x431;&#x443;&#x44E;.</p>
<p>&#x415;&#x441;&#x43B;&#x438; &#x431;&#x440;&#x43E;&#x441;&#x438;&#x442;&#x44C; &#x432; &#x441;&#x442;&#x443;&#x434;&#x435;&#x43D;&#x442;&#x430; &#x43A;&#x43D;&#x438;&#x433;&#x443; <a href="https://ru.wikipedia.org/wiki/Design_Patterns" rel="noopener noreferrer">&#x41F;&#x430;&#x442;&#x442;&#x435;&#x440;&#x43D;&#x44B; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;</a> &#x437;&#x430; &#x430;&#x432;&#x442;&#x43E;&#x440;&#x441;&#x442;&#x432;&#x43E;&#x43C; &#x201C;&#x411;&#x430;&#x43D;&#x434;&#x44B; &#x447;&#x435;&#x442;&#x44B;&#x440;&#x451;&#x445;&#x201D; &#x438; &#x43E;&#x442;&#x43E;&#x439;&#x442;&#x438; &#x432; &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x443;, &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x434;&#x43E;&#x43B;&#x433;&#x43E; &#x43D;&#x430;&#x431;&#x43B;&#x44E;&#x434;&#x430;&#x442;&#x44C; &#x437;&#x430; &#x430;&#x433;&#x43E;&#x43D;&#x438;&#x435;&#x439;. &#x41D;&#x43E; &#x44D;&#x442;&#x43E; &#x441;&#x43B;&#x438;&#x448;&#x43A;&#x43E;&#x43C; &#x436;&#x435;&#x441;&#x442;&#x43E;&#x43A;&#x43E;, &#x43F;&#x43E;&#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x43E;&#x439;&#x434;&#x451;&#x43C; &#x43F;&#x43E; &#x43F;&#x443;&#x442;&#x438; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x43E;&#x431;&#x449;&#x438;&#x445; &#x440;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x430;&#x446;&#x438;&#x439;.</p>
<p>&#x41F;&#x43E;&#x434;&#x445;&#x43E;&#x434; &#x41E;&#x41E;&#x41F;, &#x432;&#x43D;&#x435; &#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438; &#x43E;&#x442; &#x442;&#x43E;&#x433;&#x43E;, &#x441;&#x43B;&#x435;&#x434;&#x443;&#x435;&#x442;&#x435; &#x432;&#x44B; &#x435;&#x43C;&#x443; &#x438;&#x43B;&#x438; &#x43D;&#x435;&#x442;, &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x434;&#x44F;&#x435;&#x442; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x44B; &#x43D;&#x430; &#x44F;&#x437;&#x44B;&#x43A;&#x435;, &#x431;&#x43B;&#x438;&#x437;&#x43A;&#x43E;&#x43C; &#x43A; &#x44F;&#x437;&#x44B;&#x43A;&#x443; &#x431;&#x438;&#x437;&#x43D;&#x435;&#x441;-&#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;. &#x42D;&#x442;&#x43E; &#x441;&#x43D;&#x438;&#x436;&#x430;&#x435;&#x442; &#x432;&#x435;&#x440;&#x43E;&#x44F;&#x442;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x438; &#x43F;&#x440;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x43E;&#x434;&#x435; &#x441; &#xAB;&#x44F;&#x437;&#x44B;&#x43A;&#x430; &#x431;&#x438;&#x437;&#x43D;&#x435;&#x441;&#x430;&#xBB; &#x43D;&#x430; &#xAB;&#x44F;&#x437;&#x44B;&#x43A; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438;&#xBB; &#x438; &#x43D;&#x430;&#x43E;&#x431;&#x43E;&#x440;&#x43E;&#x442;.</p>
<p>&#x412; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x451;&#x43D;&#x43D;&#x44B;&#x439; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442; &#x43D;&#x430; &#x43F;&#x443;&#x442;&#x438; &#x43B;&#x44E;&#x431;&#x43E;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x430; &#x432;&#x441;&#x442;&#x440;&#x435;&#x442;&#x438;&#x442;&#x441;&#x44F; &#x43F;&#x43E;&#x43D;&#x44F;&#x442;&#x438;&#x435;, &#x440;&#x43E;&#x436;&#x434;&#x451;&#x43D;&#x43D;&#x43E;&#x435; &#x432; &#x41E;&#x41E;&#x41F;-&#x43C;&#x438;&#x440;&#x435;: <a href="https://ru.wikipedia.org/wiki/SOLID_(%D0%BE%D0%B1%D1%8A%D0%B5%D0%BA%D1%82%D0%BD%D0%BE-%D0%BE%D1%80%D0%B8%D0%B5%D0%BD%D1%82%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%BD%D0%BE%D0%B5_%D0%BF%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5)" rel="noopener noreferrer">SOLID</a>. &#x41C;&#x43E;&#x436;&#x43D;&#x43E;, &#x43E;&#x43F;&#x44F;&#x442;&#x44C; &#x436;&#x435;, &#x441;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x432; &#x412;&#x438;&#x43A;&#x438;&#x43F;&#x435;&#x434;&#x438;&#x44E; &#x438; &#x43F;&#x43E;&#x447;&#x438;&#x442;&#x430;&#x442;&#x44C;, &#x447;&#x442;&#x43E; &#x44D;&#x442;&#x43E; &#x442;&#x430;&#x43A;&#x43E;&#x435;, &#x430; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x432;&#x43E;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x43C; &#x440;&#x435;&#x441;&#x443;&#x440;&#x441;&#x43E;&#x43C; <a href="https://ota-solid.now.sh/" rel="noopener noreferrer">&#x421;&#x43E;&#x43B;&#x438;&#x434;&#x431;&#x443;&#x43A;</a>.</p>
<p>&#x410;&#x432;&#x442;&#x43E;&#x440;&#x44B;, <a href="https://bespoyasov.ru/" rel="noopener noreferrer">&#x421;&#x430;&#x448;&#x430; &#x411;&#x435;&#x441;&#x43F;&#x43E;&#x44F;&#x441;&#x43E;&#x432;</a> &#x438; <a href="https://github.com/dex157" rel="noopener noreferrer">&#x410;&#x440;&#x442;&#x451;&#x43C; &#x421;&#x430;&#x43C;&#x43E;&#x444;&#x430;&#x43B;&#x43E;&#x432;</a>, &#x43E;&#x431;&#x44A;&#x44F;&#x441;&#x43D;&#x44F;&#x44E;&#x442; &#x43F;&#x44F;&#x442;&#x44C; &#x43F;&#x440;&#x438;&#x43D;&#x446;&#x438;&#x43F;&#x43E;&#x432;, &#x43E;&#x431;&#x440;&#x430;&#x437;&#x443;&#x44E;&#x449;&#x438;&#x445; SOLID, &#x43D;&#x430; &#x43F;&#x43E;&#x43D;&#x44F;&#x442;&#x43D;&#x44B;&#x445; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x430;&#x445;, &#x430; &#x432; &#x43A;&#x43E;&#x43D;&#x446;&#x435; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x439; &#x441;&#x435;&#x43A;&#x446;&#x438;&#x438; &#x438;&#x43C;&#x435;&#x435;&#x442;&#x441;&#x44F; &#x43A;&#x440;&#x430;&#x442;&#x43A;&#x438;&#x439; &#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x43D;&#x438;&#x43A; (<em>&#x444;&#x43B;&#x435;&#x448;&#x431;&#x435;&#x43A;&#x438; &#x438;&#x437; &#x448;&#x43A;&#x43E;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x432;&#x440;&#x435;&#x43C;&#x451;&#x43D;</em>).</p>
<p>&#x41B;&#x438;&#x447;&#x43D;&#x44B;&#x439; &#x441;&#x430;&#x439;&#x442; &#x411;&#x435;&#x441;&#x43F;&#x43E;&#x44F;&#x441;&#x43E;&#x432;&#x430; &#x44F; &#x432;&#x43E;&#x43E;&#x431;&#x449;&#x435; &#x433;&#x43E;&#x440;&#x44F;&#x447;&#x43E; &#x440;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x443;&#x44E;: &#x437;&#x430;&#x433;&#x43B;&#x44F;&#x43D;&#x438;&#x442;&#x435; &#x432; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B; <a href="https://bespoyasov.ru/projects/" rel="noopener noreferrer">&#x41F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x44B;</a>, &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x43D;&#x440;&#x430;&#x432;&#x438;&#x442;&#x441;&#x44F;.</p>

    </article>

    <hr>

    
    
    
  <nav>
    
    
  </nav>

  </main>

    <script>
      document.documentElement.dataset.theme = localStorage.getItem('theme') || 'auto';
    </script>
  

</body></html>